from string import Template
### RAG PROMPTS ###

### System ###

system_prompt = Template("\n".join([
    "أنت مساعد مكلف بتوليد استجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من الوثائق المرتبطة باستفسار المستخدم.",
    "يجب عليك توليد استجابة بناءً على الوثائق المقدمة.",
    "تجاهل أي وثائق ليست ذات صلة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد استجابة.",
    "يجب عليك توليد استجابتك بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا وموجزًا في استجابتك. تجنب المعلومات غير الضرورية."
]))

### Documents ###

document_prompt = Template(
    "\n".join([
        "## رقم الوثيقة: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

### Footer ### 

footer_prompt = Template(
    "\n".join([
    "استنادًا فقط إلى الوثائق أعلاه، يرجى توليد إجابة للمستخدم",
    "## السؤال:",
    "$query",
    "",
    "## الإجابة:",
    ])
)

